Tekla.Structures.CatalogInternal.dotcatBoltLengthEnumerator_t
Serialization structure for Bolt Item Enumerator

Tekla.Structures.CatalogInternal.dotcatBoltLengthEnumerator_t.nBoltLengthItems
Number of the profile items in the enumerator.

Tekla.Structures.CatalogInternal.dotcatBoltLengthEnumerator_t.BoltGrade
Grade of the item in the enumerator.

Tekla.Structures.CatalogInternal.dotcatBoltLengthEnumerator_t.BoltSize
Size of the item in the enumerator.

Tekla.Structures.CatalogInternal.dotcatBoltLengthEnumerator_t.aBoltItemLengths
Bolt lengths list.